utility.org
#+TITLE:	ユーティリティ関数群
#+AUTHOR:	Takaaki Ishikawa
#+EMAIL:	takaxp@ieee.org
#+STARTUP:	content
#+STARTUP:	nohideblocks
#+SETUPFILE: theme-readtheorg.setup

[[https://pxaka.tokyo/wiki/doku.php?id=emacs:init.el][init.el]] に記述していた便利関数を，utility.el として分離しています．init.el では autoload を用いて utility.el を遅延読み込みするように設定してます．このようなファイルの分離で60[ms]ほど起動を高速化できます．

注意：コピペだけでは動かない可能性があります．

* orgバッファを評価

org-buffer を評価して Emacs の設定ファイルを生成／読み込みまでを自動化します．この設定では， =init.org= と =utility.org= の2つのバッファでのみ評価されるようになっています．

#+BEGIN_SRC emacs-lisp :tangle yes
  (require 'org nil t)

  ;;;###autoload
  (defun eval-org-buffer ()
    "Load init.org/utility.org and tangle init.el/utility.el."
    (interactive)
    (if (and (eq major-mode 'org-mode)
             (member (buffer-name) '("init.org" "utility.org")))
        (progn
          (org-babel-tangle)
          (let ((tangled-file
                 (concat (file-name-sans-extension (buffer-file-name)) ".el")))
            (when (file-exists-p tangled-file)
              (byte-compile-file tangled-file))))
      (message "Nothing to do for this buffer.")))
#+END_SRC

* ユーティリティ関数
** サボっていると Kyoko さんに怒られる

MacOS 用の関数です．別途，Kyoko さんの音声をインストールしておく必要があります．Mavericks だと，Otoya さんも使えます．

#+BEGIN_SRC emacs-lisp :tangle no
  (defvar kyoko-mad-mode nil)
  (defun kyoko-mad-mode-toggle ()
    (interactive)
    (setq kyoko-mad-mode (not kyoko-mad-mode))
    (cond (kyoko-mad-mode
           (message "Kyoko mad mode: ON"))
          (t
           (message "Kyoko mad mode: OFF"))))
  ;; She will be mad if you do nothing within 10 min.
  (run-with-idle-timer
   600 t
   '(lambda ()
      (when kyoko-mad-mode
        (shell-command-to-string
         "say -v Kyoko おいおまえ，遊んでないで，仕事しろ"))))
#+END_SRC

** org-buffer を dokuwiki 形式に変換し，kill-ring に格納

外部プログラム[[https://gist.github.com/1369417][org2dokuwiki.pl]]を使います．

#+BEGIN_SRC emacs-lisp :tangle yes
  (defun org2dokuwiki-cp-kill-ring ()
    "Convert the current org-file to dokuwiki text, and copy it to kill-ring."
    (interactive)
    (when (eq major-mode 'org-mode)
      (cond (buffer-file-name
             (kill-new
              (shell-command-to-string
               (concat "cat " buffer-file-name "| perl "
                       (expand-file-name "~/Dropbox/scripts/org2dokuwiki.pl"))))
             (message "Copying %s ... done" buffer-file-name)
             (sit-for 1.5)
             (message ""))
            (t (message "There is NOT such a file.")))))
#+END_SRC

** コンソールでカレントバッファのあるディレクトリに移動する

Finder で開きたいだけならば， =M-!= でミニバッファに =open .= と打ち込むだけです．

#+BEGIN_SRC emacs-lisp :tangle yes
  (defcustom open-current-directory-console-program "iTerm2.app"
    "Specify a console program"
    :type 'string
    :group 'takaxp-mac)

  ;;;###autoload
  (defun open-current-directory ()
    " Open Current Directory for MacOSX
    0) Put this function in your .emacs
    1) M-x open-current-directory
    2) Terminal will open automatically
    3) Type M-v to paste and move to a path to the current directory in Emacs"
    (interactive)
    (let ((file-path (buffer-file-name (current-buffer))))
      (unless (string= file-path nil)
        (let ((directory
               (substring file-path 0
                          (-
                           (length file-path)
                           (length (buffer-name (current-buffer)))))))
          (message "%s" directory)
          (shell-command-to-string (concat "echo cd " directory " |pbcopy"))
          (shell-command-to-string
           (concat "open -a " open-current-directory-console-program))))))
#+END_SRC

