utility.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-06-19 Mon 01:03 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>ユーティリティ関数群</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Takaaki Ishikawa" />
</head>
<body>
<div id="content">
<h1 class="title">ユーティリティ関数群</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org74fde1c">1. orgバッファを評価</a></li>
<li><a href="#orgbb9a3d6">2. ユーティリティ関数</a>
<ul>
<li><a href="#org1da5d9e">2.1. サボっていると Kyoko さんに怒られる</a></li>
<li><a href="#orgb8fb131">2.2. org-buffer を dokuwiki 形式に変換し，kill-ring に格納</a></li>
<li><a href="#orgee9e785">2.3. コンソールでカレントバッファのあるディレクトリに移動する</a></li>
<li><a href="#orgbbe9ba1">2.4. ファイルに含まれるテーブルを使って定時にアラートを表示する</a></li>
<li><a href="#orgcc6dece">2.5. 頻繁に利用するファイルをring形式でたどる</a></li>
<li><a href="#org69f5c2c">2.6. 引数のorgバッファを開く</a></li>
<li><a href="#org4376d05">2.7. orgバッファにいつものヘッダを追加する</a></li>
<li><a href="#org44b36ee">2.8. 議事録ひな形を書き入れる</a></li>
<li><a href="#org2f872da">2.9. ランダムの文字列を取得する</a></li>
<li><a href="#org7455ded">2.10. Auto-install をセットアップする</a></li>
<li><a href="#orgc7a179f">2.11. 行頭に"  - "を挿入する</a>
<ul>
<li><a href="#org0af7f5c">2.11.1. キーバインド</a></li>
</ul>
</li>
<li><a href="#org1ceff8e">2.12. 日付などを簡単に挿入する</a>
<ul>
<li><a href="#org7849cde">2.12.1. キーバインド</a></li>
</ul>
</li>
<li><a href="#org641bca0">2.13. XHTMLを利用したガントチャート生成</a></li>
<li><a href="#orgfd3f86e">2.14. 定期実行関数</a></li>
<li><a href="#org4690608">2.15. ブラウザの設定</a></li>
<li><a href="#orge6c83b9">2.16. ミニバッファに日時を表示</a></li>
<li><a href="#org21048c7">2.17. バックアップファイルの削除</a></li>
<li><a href="#orgd3d4869">2.18. 日中と夜中でテーマを切り替える</a></li>
<li><a href="#orgfd4c91f">2.19. その他</a></li>
</ul>
</li>
<li><a href="#orgcbd85f7">3. 未設定／テスト中</a>
<ul>
<li><a href="#org28586f4">3.1. byte-compile の警告を抑制する</a></li>
<li><a href="#org1469588">3.2. [window-resizer.el] 分割したウィンドウサイズを変更する</a></li>
<li><a href="#orgced035d">3.3. [idle-requie]</a></li>
<li><a href="#orgab08323">3.4. [pdf-preview]</a></li>
<li><a href="#orgfb9016d">3.5. [EasyPG]</a></li>
<li><a href="#orgcced323">3.6. [eblook]</a></li>
<li><a href="#org23d1c54">3.7. [iBuffer]</a></li>
<li><a href="#org7098456">3.8. UUID をファイル名にして所定のディレクトリにコピー／移動</a></li>
<li><a href="#orgc9cb4d1">3.9. キーバインド</a></li>
</ul>
</li>
<li><a href="#org50ccbf7">4. provide</a></li>
</ul>
</div>
</div>
<p>
<a href="http://pastelwill.jp/wiki/doku.php?id=emacs:init.el">init.el</a> に記述していた便利関数を，utility.el として分離しています．init.el では autoload を用いて utility.el を遅延読み込みするように設定してます．このようなファイルの分離で60[ms]ほど起動を高速化できます．<br />
</p>

<p>
注意：コピペだけでは動かない可能性があります．<br />
</p>

<div id="outline-container-org74fde1c" class="outline-2">
<h2 id="org74fde1c"><span class="section-number-2">1</span> orgバッファを評価</h2>
<div class="outline-text-2" id="text-1">
<p>
org-buffer を評価して Emacs の設定ファイルを生成／読み込みまでを自動化します．この設定では， <code>init.org</code> と <code>utility.org</code> の2つのバッファでのみ評価されるようになっています．<br />
</p>

<div class="org-src-container">
<pre><code class="src src-emacs-lisp">(<span style="color: #c678dd;">require</span> '<span style="color: #d19a66;">org</span> nil t)
<span style="color: #5C6370;">;;;</span><span style="color: #5C6370;">###</span><span style="color: #ff982d; font-weight: bold;">autoload</span>
(<span style="color: #c678dd;">defun</span> <span style="color: #61afef;">eval-org-buffer</span> ()
  <span style="color: #98c379;">"Load init.org/utility.org and tangle init.el/utility.el."</span>
  (<span style="color: #c678dd;">interactive</span>)
  (<span style="color: #c678dd;">if</span> (<span style="color: #c678dd;">and</span> (eq major-mode 'org-mode)
           (<span style="color: #c678dd;">or</span> (string= (buffer-name) <span style="color: #98c379;">"init.org"</span>)
               (string= (buffer-name) <span style="color: #98c379;">"utility.org"</span>)))
      (<span style="color: #c678dd;">progn</span>
        (org-babel-tangle)
        (<span style="color: #c678dd;">let</span> ((tangled-file
               (concat (file-name-sans-extension (buffer-file-name)) <span style="color: #98c379;">".el"</span>)))
          (<span style="color: #c678dd;">when</span> (file-exists-p tangled-file)
            (byte-compile-file tangled-file))))
    (message <span style="color: #98c379;">"Nothing to do for this buffer."</span>)))
</code></pre>
</div>
</div>
</div>

<div id="outline-container-orgbb9a3d6" class="outline-2">
<h2 id="orgbb9a3d6"><span class="section-number-2">2</span> ユーティリティ関数</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org1da5d9e" class="outline-3">
<h3 id="org1da5d9e"><span class="section-number-3">2.1</span> サボっていると Kyoko さんに怒られる</h3>
<div class="outline-text-3" id="text-2-1">
<p>
MacOS 用の関数です．別途，Kyoko さんの音声をインストールしておく必要があります．Mavericks だと，Otoya さんも使えます．<br />
</p>

<div class="org-src-container">
<pre><code class="src src-emacs-lisp">(<span style="color: #c678dd;">defvar</span> <span style="color: #e5c07b;">kyoko-mad-mode</span> nil)
(<span style="color: #c678dd;">defun</span> <span style="color: #61afef;">kyoko-mad-mode-toggle</span> ()
  (<span style="color: #c678dd;">interactive</span>)
  (<span style="color: #c678dd;">setq</span> kyoko-mad-mode (not kyoko-mad-mode))
  (<span style="color: #c678dd;">cond</span> (kyoko-mad-mode
         (message <span style="color: #98c379;">"Kyoko mad mode: ON"</span>))
        (t
         (message <span style="color: #98c379;">"Kyoko mad mode: OFF"</span>))))
<span style="color: #5C6370;">;; </span><span style="color: #5C6370;">She will be mad if you do nothing within 10 min.</span>
(run-with-idle-timer
 600 t
 '(lambda ()
    (<span style="color: #c678dd;">when</span> kyoko-mad-mode
      (shell-command-to-string
       <span style="color: #98c379;">"say -v Kyoko &#12362;&#12356;&#12362;&#12414;&#12360;&#65292;&#36938;&#12435;&#12391;&#12394;&#12356;&#12391;&#65292;&#20181;&#20107;&#12375;&#12429;"</span>))))
</code></pre>
</div>
</div>
</div>

<div id="outline-container-orgb8fb131" class="outline-3">
<h3 id="orgb8fb131"><span class="section-number-3">2.2</span> org-buffer を dokuwiki 形式に変換し，kill-ring に格納</h3>
<div class="outline-text-3" id="text-2-2">
<p>
外部プログラム<a href="https://gist.github.com/1369417">org2dokuwiki.pl</a>を使います．<br />
</p>

<div class="org-src-container">
<pre><code class="src src-emacs-lisp">(<span style="color: #c678dd;">defun</span> <span style="color: #61afef;">org2dokuwiki-cp-kill-ring</span> ()
  <span style="color: #98c379;">"Convert the current org-file to dokuwiki text, and copy it to kill-ring."</span>
  (<span style="color: #c678dd;">interactive</span>)
  (<span style="color: #c678dd;">when</span> (eq major-mode 'org-mode)
    (<span style="color: #c678dd;">cond</span> (buffer-file-name
           (kill-new
            (shell-command-to-string
             (concat <span style="color: #98c379;">"cat "</span> buffer-file-name <span style="color: #98c379;">"| perl "</span>
                     (expand-file-name <span style="color: #98c379;">"~/Dropbox/scripts/org2dokuwiki.pl"</span>))))
           (message <span style="color: #98c379;">"Copying %s ... done"</span> buffer-file-name)
           (sit-for 1.5)
           (message <span style="color: #98c379;">""</span>))
          (t (message <span style="color: #98c379;">"There is NOT such a file."</span>)))))
</code></pre>
</div>
</div>
</div>

<div id="outline-container-orgee9e785" class="outline-3">
<h3 id="orgee9e785"><span class="section-number-3">2.3</span> コンソールでカレントバッファのあるディレクトリに移動する</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Finder で開きたいだけならば， <code>M-!</code> でミニバッファに <code>open .</code> と打ち込むだけです．<br />
</p>

<div class="org-src-container">
<pre><code class="src src-emacs-lisp">(<span style="color: #c678dd;">defcustom</span> <span style="color: #e5c07b;">open-current-directory-console-program</span> <span style="color: #98c379;">"iTerm2.app"</span>
  <span style="color: #98c379;">"Specify a console program"</span>
  <span style="color: #56b6c2;">:type</span> 'string
  <span style="color: #56b6c2;">:group</span> 'takaxp-mac)

<span style="color: #5C6370;">;;;</span><span style="color: #5C6370;">###</span><span style="color: #ff982d; font-weight: bold;">autoload</span>
(<span style="color: #c678dd;">defun</span> <span style="color: #61afef;">open-current-directory</span> ()
  <span style="color: #98c379;">" Open Current Directory for MacOSX</span>
<span style="color: #98c379;">  0) Put this function in your .emacs</span>
<span style="color: #98c379;">  1) M-x open-current-directory</span>
<span style="color: #98c379;">  2) Terminal will open automatically</span>
<span style="color: #98c379;">  3) Type M-v to paste and move to a path to the current directory in Emacs"</span>
  (<span style="color: #c678dd;">interactive</span>)
  (<span style="color: #c678dd;">let</span> ((file-path (buffer-file-name (current-buffer))))
    (<span style="color: #c678dd;">unless</span> (string= file-path nil)
      (<span style="color: #c678dd;">let</span> ((directory
             (substring file-path 0
                        (-
                         (length file-path)
                         (length (buffer-name (current-buffer)))))))
        (message <span style="color: #98c379;">"%s"</span> directory)
        (shell-command-to-string (concat <span style="color: #98c379;">"echo cd "</span> directory <span style="color: #98c379;">" |pbcopy"</span>))
        (shell-command-to-string
         (concat <span style="color: #98c379;">"open -a "</span> open-current-directory-console-program))))))
</code></pre>
</div>
</div>
</div>
