utility.org
** ファイルに含まれるテーブルを使って定時にアラートを表示する

 # =terminal-notifier= は，現時点で sticky に対応していない．システムレベルでの制御は可能なので，別イメージをビルドし，通知で呼び出すアプリを切り替えれば対応可能と思われる．Banners タイプから Alerts タイプに切り替えるだけ．

#+BEGIN_SRC emacs-lisp :tangle yes
  (defun my:update-alarms-from-file ()
    (when (string= "trigger.org" (buffer-name))
      (set-alarms-from-file "~/Dropbox/org/trigger.org")))

  ;;;###autoload
  (defun set-alarms-from-file (file)
    "Make alarms from org-mode tables. If you have an org-mode file
       with tables with the following format:
       |------+-------+--------------------|
       | Flag |  Time | Content            |
       |------+-------+--------------------|
       |      | 07:00 | Wakeup             |
       |      |       | Read papers        |
       | X    | 12:00 | Clean up your desk |
       When it is 7:00 and 12:00, Growl notify with a message which is specified
       content column from the table. \"Read papers\" will be ignored.
       \"Clean up your desk\" will be shown by sticky mode"
    (let
        ((lines (read-line file)))
      (cancel-function-timers 'my:desktop-notify) ;; clear existing timers
      (while lines
        (set-alarm-from-line (decode-coding-string (car lines) 'utf-8))
        (setq lines (cdr lines)))))

  ;;;###autoload
  (defun set-alarm-from-line (line)
    (let
        ((hour nil)
         (min nil)
         (current-hour nil)
         (current-min nil)
         (action nil))
      (when (string-match "\\([0-2]?[0-9]\\):\\([0-5][0-9]\\)" line)
        (setq hour (substring line (match-beginning 1) (match-end 1)))
        (setq min (substring line (match-beginning 2) (match-end 2)))
        (when (string-match
               "\|\\s-*\\([^\|]+[^ ]\\)\\s-*\|$" line (match-end 2))
          (setq action
                (substring line (match-beginning 1) (match-end 1)))))
      (when (and (and hour min) action)
        ;;        (message "[%s:%s] => %s" hour min action)
        (setq current-hour (format-time-string "%H" (current-time)))
        (setq current-min (format-time-string "%M" (current-time)))
        (when (> (+ (* (string-to-number hour) 60)
                    (string-to-number min))
                 (+ (* (string-to-number current-hour) 60)
                    (string-to-number current-min)))
          (let
              ((s nil))
            (when (string-match "^\|\\s-*X\\s-*\|" line)
              (setq s 'sticky))
            ;;      (set-notify-growl hour min action s)
            (set-notify-osx-native hour min action s)
            ;;            (set-notify-mail hour min action s)
            )))))

  ;; (when (autoload-if-found
  ;;        '(todochiku-message)
  ;;        "todochiku" nil t)
  ;;   (eval-when-compile
  ;;     (require 'todochiku nil t))
  ;;   (with-eval-after-load "todochiku"
  ;;     (setq todochiku-icons-directory "~/Dropbox/emacs.d/todochiku-icons")
  ;;     (add-to-list 'todochiku-icons '(emacs . "emacs.png"))
  ;;     (require 'cl-lib)))

  ;;;###autoload
  (defun my:desktop-notify (type title hour min action s)
    (cond
     ;; ((string= type "growl")
     ;;  (todochiku-message
     ;;   title (format "%s:%s %s" hour min action) "Emacs" s))
     ((string= type "osx-native")
      (terminal-notifier-notify
       title
       (format "%s:%s %s" hour min action)))
     (t nil)))

  (defun set-notify-mail (hour min action s)
    (run-at-time (format "%s:%s" hour min) nil
                 'my:desktop-notify
                 "mail" "りまいんだ" hour min action nil))

  (defun set-notify-growl (hour min action s)
    (run-at-time (format "%s:%s" hour min) nil
                 'my:desktop-notify
                 "growl" "== REMINDER ==" hour min action s))

  (defun set-notify-osx-native (hour min action s)
    "terminal-notifier is required."
    ;;    (message "%s:%s %s %s" hour min action s)
    (run-at-time (format "%s:%s" hour min) nil
                 'my:desktop-notify
                 "osx-native" "Emacs" hour min action nil))

  (defun read-line (file)
    "Make a list from a file, which is divided by LF code"
    (with-temp-buffer
      (insert-file-contents-literally file)
      (split-string
       (buffer-string) "\n" t)))
#+END_SRC  

