utility.html

<div id="outline-container-orgbbe9ba1" class="outline-3">
<h3 id="orgbbe9ba1"><span class="section-number-3">2.4</span> ファイルに含まれるテーブルを使って定時にアラートを表示する</h3>
<div class="outline-text-3" id="text-2-4">
<div class="org-src-container">
<pre><code class="src src-emacs-lisp">(<span style="color: #c678dd;">defun</span> <span style="color: #61afef;">my:update-alarms-from-file</span> ()
  (<span style="color: #c678dd;">when</span> (string= <span style="color: #98c379;">"trigger.org"</span> (buffer-name))
    (set-alarms-from-file <span style="color: #98c379;">"~/Dropbox/org/trigger.org"</span>)))

  <span style="color: #5C6370;">;;;</span><span style="color: #5C6370;">###autoload</span>
(<span style="color: #c678dd;">defun</span> <span style="color: #61afef;">set-alarms-from-file</span> (file)
  <span style="color: #98c379;">"Make alarms from org-mode tables. If you have an org-mode file</span>
<span style="color: #98c379;">     with tables with the following format:</span>
<span style="color: #98c379;">     |------+-------+--------------------|</span>
<span style="color: #98c379;">     | Flag |  Time | Content            |</span>
<span style="color: #98c379;">     |------+-------+--------------------|</span>
<span style="color: #98c379;">     |      | 07:00 | Wakeup             |</span>
<span style="color: #98c379;">     |      |       | Read papers        |</span>
<span style="color: #98c379;">     | X    | 12:00 | Clean up your desk |</span>
<span style="color: #98c379;">     When it is 7:00 and 12:00, Growl notify with a message which is specified</span>
<span style="color: #98c379;">     content column from the table. \"Read papers\" will be ignored.</span>
<span style="color: #98c379;">     \"Clean up your desk\" will be shown by sticky mode"</span>
  (<span style="color: #c678dd;">let</span>
      ((lines (read-line file)))
    (cancel-function-timers 'my:desktop-notify) <span style="color: #5C6370;">;; </span><span style="color: #5C6370;">clear existing timers</span>
    (<span style="color: #c678dd;">while</span> lines
      (set-alarm-from-line (decode-coding-string (car lines) 'utf-8))
      (<span style="color: #c678dd;">setq</span> lines (cdr lines)))))

  <span style="color: #5C6370;">;;;</span><span style="color: #5C6370;">###autoload</span>
(<span style="color: #c678dd;">defun</span> <span style="color: #61afef;">set-alarm-from-line</span> (line)
  (<span style="color: #c678dd;">let</span>
      ((hour nil)
       (min nil)
       (current-hour nil)
       (current-min nil)
       (action nil))
    (<span style="color: #c678dd;">when</span> (string-match <span style="color: #98c379;">"</span><span style="color: #66CC99;">\\</span><span style="color: #9966CC;">(</span><span style="color: #98c379;">[0-2]?[0-9]</span><span style="color: #66CC99;">\\</span><span style="color: #9966CC;">)</span><span style="color: #98c379;">:</span><span style="color: #66CC99;">\\</span><span style="color: #9966CC;">(</span><span style="color: #98c379;">[0-5][0-9]</span><span style="color: #66CC99;">\\</span><span style="color: #9966CC;">)</span><span style="color: #98c379;">"</span> line)
      (<span style="color: #c678dd;">setq</span> hour (substring line (match-beginning 1) (match-end 1)))
      (<span style="color: #c678dd;">setq</span> min (substring line (match-beginning 2) (match-end 2)))
      (<span style="color: #c678dd;">when</span> (string-match
             <span style="color: #98c379;">"\|\\s-*</span><span style="color: #66CC99;">\\</span><span style="color: #9966CC;">(</span><span style="color: #98c379;">[</span><span style="color: #98c379;">^</span><span style="color: #98c379;">\|]+[</span><span style="color: #98c379;">^</span><span style="color: #98c379;"> ]</span><span style="color: #66CC99;">\\</span><span style="color: #9966CC;">)</span><span style="color: #98c379;">\\s-*\|$"</span> line (match-end 2))
        (<span style="color: #c678dd;">setq</span> action
              (substring line (match-beginning 1) (match-end 1)))))
    (<span style="color: #c678dd;">when</span> (<span style="color: #c678dd;">and</span> (<span style="color: #c678dd;">and</span> hour min) action)
      <span style="color: #5C6370;">;;        </span><span style="color: #5C6370;">(message "[%s:%s] =&gt; %s" hour min action)</span>
      (<span style="color: #c678dd;">setq</span> current-hour (format-time-string <span style="color: #98c379;">"%H"</span> (current-time)))
      (<span style="color: #c678dd;">setq</span> current-min (format-time-string <span style="color: #98c379;">"%M"</span> (current-time)))
      (<span style="color: #c678dd;">when</span> (&gt; (+ (* (string-to-number hour) 60)
                  (string-to-number min))
               (+ (* (string-to-number current-hour) 60)
                  (string-to-number current-min)))
        (<span style="color: #c678dd;">let</span>
            ((s nil))
          (<span style="color: #c678dd;">when</span> (string-match <span style="color: #98c379;">"^\|\\s-*X\\s-*\|"</span> line)
            (<span style="color: #c678dd;">setq</span> s 'sticky))
          <span style="color: #5C6370;">;;      </span><span style="color: #5C6370;">(set-notify-growl hour min action s)</span>
          (set-notify-osx-native hour min action s)
          <span style="color: #5C6370;">;;            </span><span style="color: #5C6370;">(set-notify-mail hour min action s)</span>
          )))))

(<span style="color: #c678dd;">when</span> (eval-after-autoload-if-found
       '(todochiku-message) <span style="color: #98c379;">"todochiku"</span> nil t nil
       '((<span style="color: #c678dd;">setq</span> todochiku-icons-directory <span style="color: #98c379;">"~/Dropbox/emacs.d/todochiku-icons"</span>)
         (add-to-list 'todochiku-icons '(emacs . <span style="color: #98c379;">"emacs.png"</span>))
         ))
  (<span style="color: #c678dd;">require</span> '<span style="color: #d19a66;">cl</span>))

  <span style="color: #5C6370;">;;;</span><span style="color: #5C6370;">###autoload</span>
(<span style="color: #c678dd;">defun</span> <span style="color: #61afef;">my:desktop-notify</span> (type title hour min action s)
  (<span style="color: #c678dd;">cond</span>
   <span style="color: #5C6370;">;; </span><span style="color: #5C6370;">((string= type "growl")</span>
   <span style="color: #5C6370;">;;  </span><span style="color: #5C6370;">(todochiku-message</span>
   <span style="color: #5C6370;">;;   </span><span style="color: #5C6370;">title (format "%s:%s %s" hour min action) "Emacs" s))</span>
   ((string= type <span style="color: #98c379;">"osx-native"</span>)
    (terminal-notifier-notify
     title
     (format <span style="color: #98c379;">"%s:%s %s"</span> hour min action)))
   (t nil)))

(<span style="color: #c678dd;">defun</span> <span style="color: #61afef;">set-notify-mail</span> (hour min action s)
  (run-at-time (format <span style="color: #98c379;">"%s:%s"</span> hour min) nil
               'my:desktop-notify
               <span style="color: #98c379;">"mail"</span> <span style="color: #98c379;">"&#12426;&#12414;&#12356;&#12435;&#12384;"</span> hour min action nil))

(<span style="color: #c678dd;">defun</span> <span style="color: #61afef;">set-notify-growl</span> (hour min action s)
  (run-at-time (format <span style="color: #98c379;">"%s:%s"</span> hour min) nil
               'my:desktop-notify
               <span style="color: #98c379;">"growl"</span> <span style="color: #98c379;">"== REMINDER =="</span> hour min action s))

(<span style="color: #c678dd;">defun</span> <span style="color: #61afef;">set-notify-osx-native</span> (hour min action s)
  <span style="color: #98c379;">"terminal-notifier is required."</span>
  <span style="color: #5C6370;">;;    </span><span style="color: #5C6370;">(message "%s:%s %s %s" hour min action s)</span>
  (run-at-time (format <span style="color: #98c379;">"%s:%s"</span> hour min) nil
               'my:desktop-notify
               <span style="color: #98c379;">"osx-native"</span> <span style="color: #98c379;">"Emacs"</span> hour min action nil))

(<span style="color: #c678dd;">defun</span> <span style="color: #61afef;">read-line</span> (file)
  <span style="color: #98c379;">"Make a list from a file, which is divided by LF code"</span>
  (<span style="color: #c678dd;">with-temp-buffer</span>
    (insert-file-contents-literally file)
    (split-string
     (buffer-string) <span style="color: #98c379;">"\n"</span> t)))
</code></pre>
</div>
</div>
</div>
