utility.org
** 頻繁に利用するファイルをring形式でたどる

http://d.hatena.ne.jp/rubikitch/20111120/elispbook

#+BEGIN_SRC emacs-lisp :tangle yes
  (defvar my:file-ring nil)

  ;;;###autoload
  (defun takaxp:make-file-ring (files)
    (setq my:file-ring (copy-sequence files)))
  ;;    (setf (cdr (last my:file-ring)) my:file-ring))
  (takaxp:make-file-ring
   '("~/Dropbox/org/work.org" "~/Dropbox/org/wg1.org"
     "~/Dropbox/org/research.org" "~/Dropbox/emacs.d/config/init.org"
     "~/Dropbox/emacs.d/config/utility.org" "~/Dropbox/org/buffer.org"
     "~/Dropbox/org/next.org"))

  ;;;###autoload
  (defun takaxp:open-file-ring ()
    (interactive)
    (find-file (car my:file-ring))
    (setq my:file-ring
          (append (cdr my:file-ring)
                  (list (car my:file-ring)))))

  ;;    (setq my:file-ring (cdr my:file-ring)))
#+END_SRC

** 引数のorgバッファを開く

#+BEGIN_SRC emacs-lisp :tangle yes
  ;;;###autoload
  (defun show-org-buffer (file)
    "Show an org-file on the current buffer"
    (interactive)
    (if (get-buffer file)
        (let ((buffer (get-buffer file)))
          (switch-to-buffer buffer)
          (message "%s" file))
      (find-file (concat "~/Dropbox/org/" file))))
#+END_SRC

** orgバッファにいつものヘッダを追加する

#+BEGIN_SRC emacs-lisp :tangle yes
  ;;;###autoload
  (defun insert-org-file-header-template ()
    (interactive)
    (when (string= major-mode 'org-mode)
      (let ((title "#+TITLE:\t\n")
            (date "#+DATE: \t\n")
            (update "#+UPDATE:\t\n")
            (author "#+AUTHOR:\tTakaaki ISHIKAWA <takaxp@ieee.org>\n")
            (option "#+OPTIONS:\t\\n:t\n")
            (other "\n"))
        (goto-char 0)
        (save-excursion
          (insert title date update author option other))
        (when (require 'org nil t)
          (org-end-of-line)))))
#+END_SRC

** 議事録ひな形を書き入れる

#+BEGIN_SRC emacs-lisp :tangle yes
  ;;;###autoload
  (defun insert-minutes-template ()
    (interactive)
    (when (string= major-mode 'org-mode)
      (let ((date "日時：\n")
            (place "場所：\n")
            (attendance "出席者：\n")
            (documents "資料：\n\n"))
        (save-excursion
          (insert date place attendance documents)))))
#+END_SRC

** ランダムの文字列を取得する

引数で桁数を渡すと，ランダムな数値の文字列を取得できます．org-mode で適当なタイトルのツリーを生成したい時に使っています．

#+BEGIN_SRC emacs-lisp :tangle yes
  (defun get-random-string (length)
    "Get a string contain the length digit number with random selection"
    (interactive)
    (random t)
    (cond ((> length 0)
           (let
               ((count length)
                (string nil)
                (tmp nil))
             (while (< 0 count)
               (setq count (1- count))
               (setq tmp string)
               (setq string
                     (concat tmp (number-to-string (random 10)))))
             (message "%s" string)))
          (t "0")))
#+END_SRC

** Auto-install をセットアップする

いつも auto-install を使うわけではないので，必要時に =init-auto-install= を実行してパラメータを設定してから auto-install でパッケージを取得するようにしています．cask+pallet 環境に移行してからは使っていません．

#+BEGIN_SRC emacs-lisp :tangle no
  (defun init-auto-install ()
    "Setup auto-install.el.
  1. Set my:auto-install-batch-list-el-url
  2. M-x init-auto-install
  3. M-x auto-install-batch hoge"
    (interactive)
    (when (and (require 'auto-install nil t)
               my:auto-install-batch-list-el-url)
      (setq auto-install-batch-list-el-url my:auto-install-batch-list-el-url)
      (setq auto-install-directory default-path)
      (setq auto-install-wget-command "/opt/local/bin/wget")
      (auto-install-update-emacswiki-package-name t)
      ;; compatibility
      (auto-install-compatibility-setup))) ; for install-elisp users
#+END_SRC

