utility.html

<div id="outline-container-orgcc6dece" class="outline-3">
<h3 id="orgcc6dece"><span class="section-number-3">2.5</span> 頻繁に利用するファイルをring形式でたどる</h3>
<div class="outline-text-3" id="text-2-5">
<p>
<a href="http://d.hatena.ne.jp/rubikitch/20111120/elispbook">http://d.hatena.ne.jp/rubikitch/20111120/elispbook</a><br />
</p>

<div class="org-src-container">
<pre><code class="src src-emacs-lisp">(<span style="color: #c678dd;">defvar</span> <span style="color: #e5c07b;">my:file-ring</span> nil)

 <span style="color: #5C6370;">;;;</span><span style="color: #5C6370;">###autoload</span>
(<span style="color: #c678dd;">defun</span> <span style="color: #61afef;">takaxp:make-file-ring</span> (files)
  (<span style="color: #c678dd;">setq</span> my:file-ring (copy-sequence files)))
<span style="color: #5C6370;">;;    </span><span style="color: #5C6370;">(setf (cdr (last my:file-ring)) my:file-ring))</span>
(takaxp:make-file-ring
 '(<span style="color: #98c379;">"~/Dropbox/org/work.org"</span> <span style="color: #98c379;">"~/Dropbox/org/wg1.org"</span>
   <span style="color: #98c379;">"~/Dropbox/org/research.org"</span> <span style="color: #98c379;">"~/Dropbox/emacs.d/config/init.org"</span>
   <span style="color: #98c379;">"~/Dropbox/emacs.d/config/utility.org"</span> <span style="color: #98c379;">"~/Dropbox/org/buffer.org"</span>
   <span style="color: #98c379;">"~/Dropbox/org/next.org"</span>))

 <span style="color: #5C6370;">;;;</span><span style="color: #5C6370;">###autoload</span>
(<span style="color: #c678dd;">defun</span> <span style="color: #61afef;">takaxp:open-file-ring</span> ()
  (<span style="color: #c678dd;">interactive</span>)
  (find-file (car my:file-ring))
  (<span style="color: #c678dd;">setq</span> my:file-ring
        (append (cdr my:file-ring)
                (list (car my:file-ring)))))

<span style="color: #5C6370;">;;    </span><span style="color: #5C6370;">(setq my:file-ring (cdr my:file-ring)))</span>
</code></pre>
</div>
</div>
</div>

<div id="outline-container-org69f5c2c" class="outline-3">
<h3 id="org69f5c2c"><span class="section-number-3">2.6</span> 引数のorgバッファを開く</h3>
<div class="outline-text-3" id="text-2-6">
<div class="org-src-container">
<pre><code class="src src-emacs-lisp"><span style="color: #5C6370;">;;;</span><span style="color: #5C6370;">###</span><span style="color: #ff982d; font-weight: bold;">autoload</span>
(<span style="color: #c678dd;">defun</span> <span style="color: #61afef;">show-org-buffer</span> (file)
  <span style="color: #98c379;">"Show an org-file on the current buffer"</span>
  (<span style="color: #c678dd;">interactive</span>)
  (<span style="color: #c678dd;">if</span> (get-buffer file)
      (<span style="color: #c678dd;">let</span> ((buffer (get-buffer file)))
        (switch-to-buffer buffer)
        (message <span style="color: #98c379;">"%s"</span> file))
    (find-file (concat <span style="color: #98c379;">"~/Dropbox/org/"</span> file))))
</code></pre>
</div>
</div>
</div>

<div id="outline-container-org4376d05" class="outline-3">
<h3 id="org4376d05"><span class="section-number-3">2.7</span> orgバッファにいつものヘッダを追加する</h3>
<div class="outline-text-3" id="text-2-7">
<div class="org-src-container">
<pre><code class="src src-emacs-lisp"><span style="color: #5C6370;">;;;</span><span style="color: #5C6370;">###</span><span style="color: #ff982d; font-weight: bold;">autoload</span>
(<span style="color: #c678dd;">defun</span> <span style="color: #61afef;">insert-org-file-header-template</span> ()
  (<span style="color: #c678dd;">interactive</span>)
  (<span style="color: #c678dd;">when</span> (string= major-mode 'org-mode)
    (<span style="color: #c678dd;">let</span> ((title <span style="color: #98c379;">"#+TITLE:\t\n"</span>)
          (date <span style="color: #98c379;">"#+DATE: \t\n"</span>)
          (update <span style="color: #98c379;">"#+UPDATE:\t\n"</span>)
          (author <span style="color: #98c379;">"#+AUTHOR:\tTakaaki ISHIKAWA <a href="mailto:takaxp%40ieee.org">&lt;takaxp@ieee.org&gt;</a>\n"</span>)
          (option <span style="color: #98c379;">"#+OPTIONS:\t\\n:t\n"</span>)
          (other <span style="color: #98c379;">"\n"</span>))
      (goto-char 0)
      (<span style="color: #c678dd;">save-excursion</span>
        (insert title date update author option other))
      (<span style="color: #c678dd;">when</span> (<span style="color: #c678dd;">require</span> '<span style="color: #d19a66;">org</span> nil t)
        (org-end-of-line)))))
</code></pre>
</div>
</div>
</div>

<div id="outline-container-org44b36ee" class="outline-3">
<h3 id="org44b36ee"><span class="section-number-3">2.8</span> 議事録ひな形を書き入れる</h3>
<div class="outline-text-3" id="text-2-8">
<div class="org-src-container">
<pre><code class="src src-emacs-lisp"><span style="color: #5C6370;">;;;</span><span style="color: #5C6370;">###</span><span style="color: #ff982d; font-weight: bold;">autoload</span>
(<span style="color: #c678dd;">defun</span> <span style="color: #61afef;">insert-minutes-template</span> ()
  (<span style="color: #c678dd;">interactive</span>)
  (<span style="color: #c678dd;">when</span> (string= major-mode 'org-mode)
    (<span style="color: #c678dd;">let</span> ((date <span style="color: #98c379;">"&#26085;&#26178;&#65306;\n"</span>)
          (place <span style="color: #98c379;">"&#22580;&#25152;&#65306;\n"</span>)
          (attendance <span style="color: #98c379;">"&#20986;&#24109;&#32773;&#65306;\n"</span>)
          (documents <span style="color: #98c379;">"&#36039;&#26009;&#65306;\n\n"</span>))
      (<span style="color: #c678dd;">save-excursion</span>
        (insert date place attendance documents)))))
</code></pre>
</div>
</div>
</div>

<div id="outline-container-org2f872da" class="outline-3">
<h3 id="org2f872da"><span class="section-number-3">2.9</span> ランダムの文字列を取得する</h3>
<div class="outline-text-3" id="text-2-9">
<p>
引数で桁数を渡すと，ランダムな数値の文字列を取得できます．org-mode で適当なタイトルのツリーを生成したい時に使っています．<br />
</p>

<div class="org-src-container">
<pre><code class="src src-emacs-lisp">(<span style="color: #c678dd;">defun</span> <span style="color: #61afef;">get-random-string</span> (length)
  <span style="color: #98c379;">"Get a string contain the length digit number with random selection"</span>
  (<span style="color: #c678dd;">interactive</span>)
  (random t)
  (<span style="color: #c678dd;">cond</span> ((&gt; length 0)
         (<span style="color: #c678dd;">let</span>
             ((count length)
              (string nil)
              (tmp nil))
           (<span style="color: #c678dd;">while</span> (&lt; 0 count)
             (<span style="color: #c678dd;">setq</span> count (1- count))
             (<span style="color: #c678dd;">setq</span> tmp string)
             (<span style="color: #c678dd;">setq</span> string
                   (concat tmp (number-to-string (random 10)))))
           (message <span style="color: #98c379;">"%s"</span> string)))
        (t <span style="color: #98c379;">"0"</span>)))
</code></pre>
</div>
</div>
</div>

<div id="outline-container-org7455ded" class="outline-3">
<h3 id="org7455ded"><span class="section-number-3">2.10</span> Auto-install をセットアップする</h3>
<div class="outline-text-3" id="text-2-10">
<p>
いつも auto-install を使うわけではないので，必要時に <code>init-auto-install</code> を実行してパラメータを設定してから auto-install でパッケージを取得するようにしています．cask+pallet 環境に移行してからは使っていません．<br />
</p>

<div class="org-src-container">
<pre><code class="src src-emacs-lisp">(<span style="color: #c678dd;">defun</span> <span style="color: #61afef;">init-auto-install</span> ()
  <span style="color: #98c379;">"Setup auto-install.el.</span>
<span style="color: #98c379;">1. Set my:auto-install-batch-list-el-url</span>
<span style="color: #98c379;">2. M-x init-auto-install</span>
<span style="color: #98c379;">3. M-x auto-install-batch hoge"</span>
  (<span style="color: #c678dd;">interactive</span>)
  (<span style="color: #c678dd;">when</span> (<span style="color: #c678dd;">and</span> (<span style="color: #c678dd;">require</span> '<span style="color: #d19a66;">auto-install</span> nil t)
             my:auto-install-batch-list-el-url)
    (<span style="color: #c678dd;">setq</span> auto-install-batch-list-el-url my:auto-install-batch-list-el-url)
    (<span style="color: #c678dd;">setq</span> auto-install-directory default-path)
    (<span style="color: #c678dd;">setq</span> auto-install-wget-command <span style="color: #98c379;">"/opt/local/bin/wget"</span>)
    (auto-install-update-emacswiki-package-name t)
    <span style="color: #5C6370;">;; </span><span style="color: #5C6370;">compatibility</span>
    (auto-install-compatibility-setup))) <span style="color: #5C6370;">; </span><span style="color: #5C6370;">for install-elisp users</span>
</code></pre>
</div>
</div>
</div>
