utility.el

(defvar my:file-ring nil)

;;;###autoload
(defun my:make-file-ring (files)
  (setq my:file-ring (copy-sequence files)))
;;    (setf (cdr (last my:file-ring)) my:file-ring))
(my:make-file-ring
 '("~/Dropbox/org/work.org" "~/Dropbox/org/daily.org" "~/Dropbox/org/wg1.org"
   "~/Dropbox/org/research.org" "~/Dropbox/emacs.d/config/init.org"))

;;;###autoload
(defun my:open-file-ring ()
  (interactive)
  (find-file (car my:file-ring))
  (setq my:file-ring
        (append (cdr my:file-ring)
                (list (car my:file-ring)))))

;;    (setq my:file-ring (cdr my:file-ring)))

;;;###autoload
(defun show-org-buffer (file)
  "Show an org-file on the current buffer"
  (interactive)
  (if (get-buffer file)
      (let ((buffer (get-buffer file)))
        (switch-to-buffer buffer)
        (message "%s" file))
    (find-file (concat "~/Dropbox/org/" file))))

;;;###autoload
(defun insert-org-file-header-template ()
  (interactive)
  (when (string= major-mode 'org-mode)
    (let ((title "#+TITLE:\t\n")
          (date "#+DATE: \t\n")
          (update "#+UPDATE:\t\n")
          (author "#+AUTHOR:\tTakaaki ISHIKAWA <takaxp@ieee.org>\n")
          (option "#+OPTIONS:\t\\n:t\n")
          (other "\n"))
      (goto-char 0)
      (save-excursion
        (insert title date update author option other))
      (when (require 'org nil t)
        (org-end-of-line)))))

;;;###autoload
(defun insert-minutes-template ()
  (interactive)
  (when (string= major-mode 'org-mode)
    (let ((date "日時：\n")
          (place "場所：\n")
          (attendance "出席者：\n")
          (documents "資料：\n\n"))
      (save-excursion
        (insert date place attendance documents)))))

(defun get-random-string (length)
  "Get a string contain the length digit number with random selection"
  (interactive)
  (random t)
  (cond ((> length 0)
         (let
             ((count length)
              (string nil)
              (tmp nil))
           (while (< 0 count)
             (setq count (1- count))
             (setq tmp string)
             (setq string
                   (concat tmp (number-to-string (random 10)))))
           (message "%s" string)))
        (t "0")))

;;;###autoload
