utility.org
** 行頭に"  - "を挿入する

#+BEGIN_SRC emacs-lisp :tangle yes
  ;;;###autoload
  (defun add-itemize-head (arg)
    "Insert \"  - \" at the head of line.
    If the cursor is already at the head of line, it is NOT returned back to the
    original position again. Otherwise, the cursor is moved to the right of the
    inserted string. \"  - [ ] \" will be inserted using C-u prefix."
    (interactive "P")
    (let ((item-string "  - "))
      (when arg
        (setq item-string "  - [ ] "))
      (cond ((= (point) (line-beginning-position))
             (insert item-string))
            (t (save-excursion
                 (move-beginning-of-line 1)
                 (insert item-string))))))
#+END_SRC

** 日付などを簡単に挿入する

http://www.fan.gr.jp/~ring/doc/elisp_20/elisp_38.html#SEC608

#+BEGIN_SRC emacs-lisp :tangle yes :exports none
  (defun insert-formatted-current-date ()
    "Insert a timestamp at the cursor position. C-u will add [] brackets."
    (interactive)
    (insert (format-time-string "%Y-%m-%d")))
  (defun insert-formatted-current-time ()
    (interactive)
    (insert (format-time-string "%H:%M")))
  (defun insert-formatted-signature ()
    (interactive)
    (insert (concat (format-time-string "%Y-%m-%d") "  " user-full-name
                    "  <" user-mail-address ">")))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle no :exports yes
  (defun insert-formatted-current-date (arg)
    "Insert a timestamp at the cursor position. C-u will add [] brackets."
    (interactive "p")
    (case arg
      (4 (if (equal major-mode 'org-mode)
             (org-time-stamp-inactive)
           (insert (format-time-string "[%Y-%m-%d]"))))
      (t (insert (format-time-string "%Y-%m-%d")))))
  (defun insert-formatted-current-time ()
    (interactive)
    (insert (format-time-string "%H:%M")))
  (defun insert-formatted-signature ()
    (interactive)
    (insert (concat (format-time-string "%Y-%m-%d") "  " user-full-name
                    "  <" user-mail-address ">")))
#+END_SRC

*** キーバインド

#+BEGIN_SRC emacs-lisp :tangle yes
(global-set-key (kbd "C-0") 'insert-formatted-current-date)
(global-set-key (kbd "C-9") 'insert-formatted-current-time)
#+END_SRC

