utility.html

<div id="outline-container-orgc7a179f" class="outline-3">
<h3 id="orgc7a179f"><span class="section-number-3">2.11</span> 行頭に"  - "を挿入する</h3>
<div class="outline-text-3" id="text-2-11">
<div class="org-src-container">
<pre><code class="src src-emacs-lisp"><span style="color: #5C6370;">;;;</span><span style="color: #5C6370;">###</span><span style="color: #ff982d; font-weight: bold;">autoload</span>
(<span style="color: #c678dd;">defun</span> <span style="color: #61afef;">add-itemize-head</span> (arg)
  <span style="color: #98c379;">"Insert \"  - \" at the head of line.</span>
<span style="color: #98c379;">  If the cursor is already at the head of line, it is NOT returned back to the</span>
<span style="color: #98c379;">  original position again. Otherwise, the cursor is moved to the right of the</span>
<span style="color: #98c379;">  inserted string. \"  - [ ] \" will be inserted using C-u prefix."</span>
  (<span style="color: #c678dd;">interactive</span> <span style="color: #98c379;">"P"</span>)
  (<span style="color: #c678dd;">let</span> ((item-string <span style="color: #98c379;">"  - "</span>))
    (<span style="color: #c678dd;">when</span> arg
      (<span style="color: #c678dd;">setq</span> item-string <span style="color: #98c379;">"  - [ ] "</span>))
    (<span style="color: #c678dd;">cond</span> ((= (point) (line-beginning-position))
           (insert item-string))
          (t (<span style="color: #c678dd;">save-excursion</span>
               (move-beginning-of-line 1)
               (insert item-string))))))
</code></pre>
</div>
</div>

<div id="outline-container-org0af7f5c" class="outline-4">
<h4 id="org0af7f5c"><span class="section-number-4">2.11.1</span> キーバインド</h4>
<div class="outline-text-4" id="text-2-11-1">
<p>
<code>C-u C-M--</code> とすれば，[ ] を付加できます．<br />
</p>

<div class="org-src-container">
<pre><code class="src src-emacs-lisp">(global-set-key (kbd <span style="color: #98c379;">"C-M--"</span>) 'add-itemize-head)
</code></pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org1ceff8e" class="outline-3">
<h3 id="org1ceff8e"><span class="section-number-3">2.12</span> 日付などを簡単に挿入する</h3>
<div class="outline-text-3" id="text-2-12">
<p>
<a href="http://www.fan.gr.jp/~ring/doc/elisp_20/elisp_38.html#SEC608">http://www.fan.gr.jp/~ring/doc/elisp_20/elisp_38.html#SEC608</a><br />
</p>

<div class="org-src-container">
<pre><code class="src src-emacs-lisp">(<span style="color: #c678dd;">defun</span> <span style="color: #61afef;">insert-formatted-current-date</span> ()
  <span style="color: #98c379;">"Insert a timestamp at the cursor position. C-u will add [] brackets."</span>
  (<span style="color: #c678dd;">interactive</span>)
  (insert (format-time-string <span style="color: #98c379;">"%Y-%m-%d"</span>)))
(<span style="color: #c678dd;">defun</span> <span style="color: #61afef;">insert-formatted-current-time</span> ()
  (<span style="color: #c678dd;">interactive</span>)
  (insert (format-time-string <span style="color: #98c379;">"%H:%M"</span>)))
(<span style="color: #c678dd;">defun</span> <span style="color: #61afef;">insert-formatted-signature</span> ()
  (<span style="color: #c678dd;">interactive</span>)
  (insert (concat (format-time-string <span style="color: #98c379;">"%Y-%m-%d"</span>) <span style="color: #98c379;">"  "</span> user-full-name
                  <span style="color: #98c379;">"  &lt;"</span> user-mail-address <span style="color: #98c379;">"&gt;"</span>)))
</code></pre>
</div>

<div class="org-src-container">
<pre><code class="src src-emacs-lisp">(<span style="color: #c678dd;">defun</span> <span style="color: #61afef;">insert-formatted-current-date</span> (arg)
  <span style="color: #98c379;">"Insert a timestamp at the cursor position. C-u will add [] brackets."</span>
  (<span style="color: #c678dd;">interactive</span> <span style="color: #98c379;">"p"</span>)
  (<span style="color: #c678dd;">case</span> arg
    (4 (<span style="color: #c678dd;">if</span> (equal major-mode 'org-mode)
           (org-time-stamp-inactive)
         (insert (format-time-string <span style="color: #98c379;">"[%Y-%m-%d]"</span>))))
    (t (insert (format-time-string <span style="color: #98c379;">"%Y-%m-%d"</span>)))))
(<span style="color: #c678dd;">defun</span> <span style="color: #61afef;">insert-formatted-current-time</span> ()
  (<span style="color: #c678dd;">interactive</span>)
  (insert (format-time-string <span style="color: #98c379;">"%H:%M"</span>)))
(<span style="color: #c678dd;">defun</span> <span style="color: #61afef;">insert-formatted-signature</span> ()
  (<span style="color: #c678dd;">interactive</span>)
  (insert (concat (format-time-string <span style="color: #98c379;">"%Y-%m-%d"</span>) <span style="color: #98c379;">"  "</span> user-full-name
                  <span style="color: #98c379;">"  &lt;"</span> user-mail-address <span style="color: #98c379;">"&gt;"</span>)))
</code></pre>
</div>
</div>
