utility.org
** XHTMLを利用したガントチャート生成

最近使っていません．

#+BEGIN_SRC emacs-lisp :tangle yes
  (defcustom my:auto-install-batch-list-el-url nil
    "URL of a auto-install-batch-list.el"
    :type 'string
    :group 'takaxp-utility)

  ;; Publish an xml file to show a Gantt Chart
  (defcustom default-timeline-csv-file nil
    "source.csv"
    :type 'string
    :group 'takaxp-utility)

  (defcustom default-timeline-xml-business-file nil
    "XML file for business schedule"
    :type 'string
    :group 'takaxp-utility)

  (defcustom default-timeline-xml-private-file nil
    "XML file for private schedule"
    :type 'string
    :group 'takaxp-utility)

  (defcustom default-timeline nil
    "a template index.html"
    :type 'string
    :group 'takaxp-utility)

  (with-eval-after-load "org"
    (defun export-timeline-business ()
      "Export schedule table as an XML source to create an web page"
      (interactive)
      (when (and default-timeline
                 (and default-timeline-csv-file
                      default-timeline-xml-business-file))
        (shell-command-to-string (concat "rm -f " default-timeline-csv-file))
        (org-table-export default-timeline-csv-file "orgtbl-to-csv")
        (shell-command-to-string (concat "org2gantt.pl > "
                                         default-timeline-xml-business-file))
        (shell-command-to-string (concat "open " default-timeline)))))

  (defun export-timeline-private ()
    "Export schedule table as an XML source to create an web page"
    (interactive)
    (when (and default-timeline
               (and default-timeline-csv-file
                    default-timeline-xml-private-file))
      (shell-command-to-string (concat "rm -f " default-timeline-csv-file))
      (org-table-export default-timeline-csv-file "orgtbl-to-csv")
      (shell-command-to-string (concat "org2gantt.pl > "
                                       default-timeline-xml-private-file))
      (shell-command-to-string (concat "open " default-timeline))))

#+END_SRC

** 定期実行関数

orgバッファからカレンダーを生成し，外部サーバに投げます．また，MobileOrgに最新情報を流しています．

#+BEGIN_SRC emacs-lisp :tangle yes
  (defvar ox-icalendar-activate nil)
  (with-eval-after-load "org"
    (run-with-idle-timer 600 t
                         '(lambda ()
                            (reload-ical-export)))
    ;;    (run-with-idle-timer 1000 t 'org-mobile-push)
    ;; FIXME
    (add-hook 'focus-in-hook '(lambda () (setq ox-icalendar-activate nil)))
    (add-hook 'focus-out-hook '(lambda () (setq ox-icalendar-activate t))))

  ;;;###autoload
  (defun reload-ical-export ()
    "Export org files as an iCal format file"
    (interactive)
    (when (and (string= major-mode 'org-mode) ox-icalendar-activate)
      (my:ox-icalendar)))
#+END_SRC

** ブラウザの設定

#+BEGIN_SRC emacs-lisp :tangle yes
  ;; http://stackoverflow.com/questions/4506249/how-to-make-emacs-org-mode-open-links-to-sites-in-google-chrome
  ;; http://www.koders.com/lisp/fidD53E4053393F9CD578FA7D2AA58BD12FDDD8EB89.aspx?s="skim
  (when (autoload-if-found
         '(browse-url)
         "browse-url" nil t)
    (with-eval-after-load "browse-url"
      (cond
       ((eq window-system 'ns)
        (setq browse-url-generic-program 'google-chrome))
       ((eq window-system 'mac)
        (setq browse-url-browser-function 'browse-url-generic)
        (setq browse-url-generic-program "/Applications/Google Chrome.app/Contents/MacOS/Google Chrome"))
       (t
        nil))))

  ;;(setq browse-url-browser-function 'browse-url-default-macosx-browser)
  ;;(setq browse-url-browser-function 'browse-url-default-windows-browser)
  ;;(setq browse-url-browser-function 'browse-url-chrome)
#+END_SRC

