utility.html

<div id="outline-container-org7849cde" class="outline-4">
<h4 id="org7849cde"><span class="section-number-4">2.12.1</span> キーバインド</h4>
<div class="outline-text-4" id="text-2-12-1">
<div class="org-src-container">
<pre><code class="src src-emacs-lisp">(global-set-key (kbd <span style="color: #98c379;">"C-0"</span>) 'insert-formatted-current-date)
(global-set-key (kbd <span style="color: #98c379;">"C-9"</span>) 'insert-formatted-current-time)
</code></pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org641bca0" class="outline-3">
<h3 id="org641bca0"><span class="section-number-3">2.13</span> XHTMLを利用したガントチャート生成</h3>
<div class="outline-text-3" id="text-2-13">
<p>
最近使っていません．<br />
</p>

<div class="org-src-container">
<pre><code class="src src-emacs-lisp">(<span style="color: #c678dd;">defcustom</span> <span style="color: #e5c07b;">my:auto-install-batch-list-el-url</span> nil
  <span style="color: #98c379;">"URL of a auto-install-batch-list.el"</span>
  <span style="color: #56b6c2;">:type</span> 'string
  <span style="color: #56b6c2;">:group</span> 'takaxp-utility)

<span style="color: #5C6370;">;; </span><span style="color: #5C6370;">Publish an xml file to show a Gantt Chart</span>
(<span style="color: #c678dd;">defcustom</span> <span style="color: #e5c07b;">default-timeline-csv-file</span> nil
  <span style="color: #98c379;">"source.csv"</span>
  <span style="color: #56b6c2;">:type</span> 'string
  <span style="color: #56b6c2;">:group</span> 'takaxp-utility)

(<span style="color: #c678dd;">defcustom</span> <span style="color: #e5c07b;">default-timeline-xml-business-file</span> nil
  <span style="color: #98c379;">"XML file for business schedule"</span>
  <span style="color: #56b6c2;">:type</span> 'string
  <span style="color: #56b6c2;">:group</span> 'takaxp-utility)

(<span style="color: #c678dd;">defcustom</span> <span style="color: #e5c07b;">default-timeline-xml-private-file</span> nil
  <span style="color: #98c379;">"XML file for private schedule"</span>
  <span style="color: #56b6c2;">:type</span> 'string
  <span style="color: #56b6c2;">:group</span> 'takaxp-utility)

(<span style="color: #c678dd;">defcustom</span> <span style="color: #e5c07b;">default-timeline</span> nil
  <span style="color: #98c379;">"a template index.html"</span>
  <span style="color: #56b6c2;">:type</span> 'string
  <span style="color: #56b6c2;">:group</span> 'takaxp-utility)

(<span style="color: #c678dd;">with-eval-after-load</span> <span style="color: #98c379;">"org"</span>
  (<span style="color: #c678dd;">defun</span> <span style="color: #61afef;">export-timeline-business</span> ()
    <span style="color: #98c379;">"Export schedule table as an XML source to create an web page"</span>
    (<span style="color: #c678dd;">interactive</span>)
    (<span style="color: #c678dd;">when</span> (<span style="color: #c678dd;">and</span> default-timeline
               (<span style="color: #c678dd;">and</span> default-timeline-csv-file
                    default-timeline-xml-business-file))
      (shell-command-to-string (concat <span style="color: #98c379;">"rm -f "</span> default-timeline-csv-file))
      (org-table-export default-timeline-csv-file <span style="color: #98c379;">"orgtbl-to-csv"</span>)
      (shell-command-to-string (concat <span style="color: #98c379;">"org2gantt.pl &gt; "</span>
                                       default-timeline-xml-business-file))
      (shell-command-to-string (concat <span style="color: #98c379;">"open "</span> default-timeline)))))

(<span style="color: #c678dd;">defun</span> <span style="color: #61afef;">export-timeline-private</span> ()
  <span style="color: #98c379;">"Export schedule table as an XML source to create an web page"</span>
  (<span style="color: #c678dd;">interactive</span>)
  (<span style="color: #c678dd;">when</span> (<span style="color: #c678dd;">and</span> default-timeline
             (<span style="color: #c678dd;">and</span> default-timeline-csv-file
                  default-timeline-xml-private-file))
    (shell-command-to-string (concat <span style="color: #98c379;">"rm -f "</span> default-timeline-csv-file))
    (org-table-export default-timeline-csv-file <span style="color: #98c379;">"orgtbl-to-csv"</span>)
    (shell-command-to-string (concat <span style="color: #98c379;">"org2gantt.pl &gt; "</span>
                                     default-timeline-xml-private-file))
    (shell-command-to-string (concat <span style="color: #98c379;">"open "</span> default-timeline))))

</code></pre>
</div>
</div>
</div>

<div id="outline-container-orgfd3f86e" class="outline-3">
<h3 id="orgfd3f86e"><span class="section-number-3">2.14</span> 定期実行関数</h3>
<div class="outline-text-3" id="text-2-14">
<p>
orgバッファからカレンダーを生成し，外部サーバに投げます．また，MobileOrgに最新情報を流しています．<br />
</p>

<div class="org-src-container">
<pre><code class="src src-emacs-lisp">(<span style="color: #c678dd;">defvar</span> <span style="color: #e5c07b;">ox-icalendar-activate</span> nil)
(<span style="color: #c678dd;">with-eval-after-load</span> <span style="color: #98c379;">"org"</span>
  (run-with-idle-timer 600 t
                       '(lambda ()
                          (reload-ical-export)))
  <span style="color: #5C6370;">;;    </span><span style="color: #5C6370;">(run-with-idle-timer 1000 t 'org-mobile-push)</span>
  <span style="color: #5C6370;">;; </span><span style="color: #5C6370;">FIXME</span>
  (add-hook 'focus-in-hook '(lambda () (<span style="color: #c678dd;">setq</span> ox-icalendar-activate nil)))
  (add-hook 'focus-out-hook '(lambda () (<span style="color: #c678dd;">setq</span> ox-icalendar-activate t))))

<span style="color: #5C6370;">;;;</span><span style="color: #5C6370;">###</span><span style="color: #ff982d; font-weight: bold;">autoload</span>
(<span style="color: #c678dd;">defun</span> <span style="color: #61afef;">reload-ical-export</span> ()
  <span style="color: #98c379;">"Export org files as an iCal format file"</span>
  (<span style="color: #c678dd;">interactive</span>)
  (<span style="color: #c678dd;">when</span> (<span style="color: #c678dd;">and</span> (string= major-mode 'org-mode) ox-icalendar-activate)
    (my:ox-icalendar)))
</code></pre>
</div>
</div>
</div>

<div id="outline-container-org4690608" class="outline-3">
<h3 id="org4690608"><span class="section-number-3">2.15</span> ブラウザの設定</h3>
<div class="outline-text-3" id="text-2-15">
<div class="org-src-container">
<pre><code class="src src-emacs-lisp"><span style="color: #5C6370;">;; </span><span style="color: #5C6370;">http://stackoverflow.com/questions/4506249/how-to-make-emacs-org-mode-open-links-to-sites-in-google-chrome</span>
<span style="color: #5C6370;">;; </span><span style="color: #5C6370;">http://www.koders.com/lisp/fidD53E4053393F9CD578FA7D2AA58BD12FDDD8EB89.aspx?s="skim</span>
(eval-after-autoload-if-found
 '(browse-url) <span style="color: #98c379;">"browse-url"</span> nil t nil
 '((<span style="color: #c678dd;">cond</span>
    ((eq window-system 'ns)
     (<span style="color: #c678dd;">setq</span> browse-url-generic-program 'google-chrome))
    ((eq window-system 'mac)
     (<span style="color: #c678dd;">setq</span> browse-url-browser-function 'browse-url-generic)          
     (<span style="color: #c678dd;">setq</span> browse-url-generic-program <span style="color: #98c379;">"/Applications/Google Chrome.app/Contents/MacOS/Google Chrome"</span>))
    (t
     nil))))

<span style="color: #5C6370;">;;</span><span style="color: #5C6370;">(setq browse-url-browser-function 'browse-url-default-macosx-browser)</span>
<span style="color: #5C6370;">;;</span><span style="color: #5C6370;">(setq browse-url-browser-function 'browse-url-default-windows-browser)</span>
<span style="color: #5C6370;">;;</span><span style="color: #5C6370;">(setq browse-url-browser-function 'browse-url-chrome)</span>
</code></pre>
</div>
</div>
</div>
