utility.org
** ミニバッファに日時を表示
#+BEGIN_SRC emacs-lisp :tangle yes
  ;;;###autoload
  (defun takaxp:date ()
    (interactive)
    (message "%s" (concat
                   (format-time-string "%Y-%m-%d") " ("
                   (format-time-string "%a") ") "
                   (format-time-string "%H:%M"))))
  (global-set-key (kbd "C-c t") 'takaxp:date)
#+END_SRC
** バックアップファイルの削除
#+BEGIN_SRC emacs-lisp :tangle yes
  ;; find ~/.emacs.d/backup  -type f -name '*15-04-24_*' -print0 | while read -r -d '' file; do echo -n " \"$file\""; done | xargs -0
  (defun recursive-delete-backup-files (count)
    (if (= count 1)
        1
      (recursive-delete-backup-files (1- count)))
    (delete-backup-files count))

  ;;;###autoload
  (defun delete-backup-files (&optional day-shift)
    "Delete backup files created in yesterday.
    > find ~/.emacs.d/backup -type f -name '*YY-MM-DD_*' -print0 | xargs -0"
    (interactive)
    (unless day-shift
      (setq day-shift 1))
    (let* ((backup-dir "~/.emacs.d/backup")
           (cmd (concat "find " backup-dir "  -type f -name \'*"
                        (format-time-string
                         "%y-%m-%d_"
                         (time-subtract (current-time)
                                        (seconds-to-time
                                         (* day-shift (* 24 3600)))))
                        "*\' -print0 | while read -r -d \'\' file; "
                        " do echo -n \" \\\"$file\\\"\"; done | xargs -0"))
           (files (shell-command-to-string cmd)))
    ;;;      (message "%s" cmd)
      (unless (string= files "")
        (message "%s" files)
        (shell-command-to-string (concat "rm -r " files)))))
#+END_SRC
** 日中と夜中でテーマを切り替える

#+BEGIN_SRC emacs-lisp :tangle yes
  ;;;###autoload
  (defun my:daylight-theme ()
    (interactive)
    (when (require 'daylight-theme nil t)
      (mapc 'disable-theme custom-enabled-themes)
      (load-theme 'daylight t)
      (moom-reset-font-size)))

  ;;;###autoload
  (defun my:night-theme ()
    (interactive)
    (when (require 'night-theme nil t) ;; atom-one-dark-theme
      (mapc 'disable-theme custom-enabled-themes)
      (load-theme 'night t)
      (moom-reset-font-size)))
#+END_SRC

** chomp

改行コードを削除した文字列を返す．

#+BEGIN_SRC emacs-lisp :tangle yes
  (defun chomp (str)
    "Chomp leading and tailing whitespace from STR."
    (while (string-match "\\`\n+\\|^\\s-+\\|\\s-+$\\|\n+\\'"
                         str)
      (setq str (replace-match "" t t str)))
    str)
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle no :exports none
  (defun chomp (str)
    (replace-regexp-in-string "[\n\r]+$" "" str))
#+END_SRC

** iTerm2.app を呼び出す関数

#+BEGIN_SRC emacs-lisp :tangle yes
  ;;;###autoload
  (defun my:cmd-to-open-iterm2 ()
    (interactive)
    (shell-command-to-string "open -a iTerm2.app"))
#+END_SRC

** lingr にログインする

#+BEGIN_SRC emacs-lisp :tangle yes
  (defun my:lingr-login ()
    (when (string= "Sat" (format-time-string "%a"))
      (lingr-login)))
#+END_SRC

** 特定のファイルを Dropbox 以下にバックアップする

#+BEGIN_SRC emacs-lisp :tangle yes
  (defun my:backup (files &optional dropbox)
    "Backup a file to `Dropbox/backup' directory. If `dropbox' option is provided then the value is uased as a root directory."
    (interactive "P")
    (let ((system (system-name))
          (rootdir (or dropbox "~/Dropbox")))
      (if (and system
               (stringp rootdir)
               (file-directory-p (or rootdir (expand-file-name rootdir))))
          (mapc
           (lambda (file)
             (if (and (stringp file)
                      (file-readable-p (or file (expand-file-name file))))
                 (shell-command-to-string
                  (concat "cp -f " file " " rootdir "/backup/" system "/"))
               (message (format "--- backup failure: %s" file))))
           (if (listp files)
               files
             (list files)))
        (message (format "--- backup-dir does not exist: %s" rootdir)))))
#+END_SRC

