utility.org
** その他

#+BEGIN_SRC emacs-lisp :tangle yes
    ;;; Test function from GNU Emacs (O'REILLY, P.328)
  ;;;###autoload
  (defun count-words-buffer ()
    "Count the number of words in the current buffer"
    (interactive)
    (save-excursion
      (let ((count 0))
        (goto-char (point-min))
        (while (< (point) (point-max))
          (forward-word 1)
          (setq count (1+ count)))
        (message "buffer contains %d words." count))))

      ;;; Test function for AppleScript
      ;;; Cite: http://sakito.jp/emacs/emacsobjectivec.html
  (defun do-test-applescript ()
    (interactive)
    (do-applescript
     (format
      (concat
       "display dialog \"Hello world!\" \r"))))

  ;;;###autoload
  (defun describe-timer ()
    "see http://masutaka.net/chalow/2009-12-05-1.html"
    (interactive)
    (let ((tl timer-list) time
          (timer nil))
      (pop-to-buffer (get-buffer-create "*timer*"))
      (erase-buffer)
      (insert
       "TIME           FUNCTION\n"
       "-------------- ----------------------\n")
      (while tl
        (setq timer (car tl))
        (insert
         (concat
          (format-time-string "%m/%d %T"
                              (list (aref timer 1)
                                    (aref timer 2)
                                    (aref timer 3)))
          " "
          (symbol-name (aref timer 5))
          "\n"))
        (setq tl (cdr tl)))
      (read-only-mode 1)))
#+END_SRC

* 未設定／テスト中
** byte-compile の警告を抑制する

#+BEGIN_SRC emacs-lisp :tangle no
;; Avoid warning (for sense-region)
;; Warning: 'mapcar' called for effect; use 'mapc' or 'dolist' insted
(setq byte-compile-warnings
      '(free-vars unresolved callargs redefine obsolete noruntime
		  cl-functions interactive-only make-local))
#+END_SRC

** [window-resizer.el] 分割したウィンドウサイズを変更する

http://d.hatena.ne.jp/khiker/20100119/window_resize

以下の警告を参考に書き換えた．

#+BEGIN_SRC emacs-lisp :tangle no
In my:window-resizer:
utility.el:333:23:Warning: `last-command-char' is an obsolete variable (as of
    Emacs at least 19.34); use `last-command-event' instead.
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle yes
  ;;;###autoload
  (defun takaxp:window-resizer ()
    "Control separated window size and position.
     Type {j,k,l,m} to adjust windows size."
    (interactive)
    (let ((window-obj (selected-window))
          (current-width (window-width))
          (current-height (window-height))
          (dx (if (= (nth 0 (window-edges)) 0) 1
                -1))
          (dy (if (= (nth 1 (window-edges)) 0) 1
                -1))
          action c)
      (catch 'end-flag
        (while t
          (setq action
                (read-key-sequence-vector (format "size[%dx%d]"
                                                  (window-width)
                                                  (window-height))))
          (setq c (aref action 0))
          (cond ((= c ?l)
                 (enlarge-window-horizontally dx))
                ((= c ?h)
                 (shrink-window-horizontally dx))
                ((= c ?j)
                 (enlarge-window dy))
                ((= c ?k)
                 (shrink-window dy))
                ;; otherwise
                (t
                 (let ((last-command-event (aref action 0))
                       (command (key-binding action)))
                   (when command
                     (call-interactively command)))
                 (message "Quit")
                 (throw 'end-flag t)))))))
#+END_SRC

** [idle-requie]
#+BEGIN_SRC emacs-lisp :tangle no
(require 'idle-require)
(idle-require-mode 1)
#+END_SRC

** [pdf-preview]
#+BEGIN_SRC emacs-lisp :tangle no
(require 'pdf-preview)
#+END_SRC

** [EasyPG]
#+BEGIN_SRC emacs-lisp :tangle no
  (when (require 'epa-setup nil t)
    (epa-file-enable))
#+END_SRC

