utility.html

<div id="outline-container-orgfd4c91f" class="outline-3">
<h3 id="orgfd4c91f"><span class="section-number-3">2.19</span> その他</h3>
<div class="outline-text-3" id="text-2-19">
<div class="org-src-container">
<pre><code class="src src-emacs-lisp">  <span style="color: #5C6370;">;;; </span><span style="color: #5C6370;">Test function from GNU Emacs (O'REILLY, P.328)</span>
  <span style="color: #5C6370;">;;;</span><span style="color: #5C6370;">###autoload</span>
(<span style="color: #c678dd;">defun</span> <span style="color: #61afef;">count-words-buffer</span> ()
  <span style="color: #98c379;">"Count the number of words in the current buffer"</span>
  (<span style="color: #c678dd;">interactive</span>)
  (<span style="color: #c678dd;">save-excursion</span>
    (<span style="color: #c678dd;">let</span> ((count 0))
      (goto-char (point-min))
      (<span style="color: #c678dd;">while</span> (&lt; (point) (point-max))
        (forward-word 1)
        (<span style="color: #c678dd;">setq</span> count (1+ count)))
      (message <span style="color: #98c379;">"buffer contains %d words."</span> count))))

    <span style="color: #5C6370;">;;; </span><span style="color: #5C6370;">Test function for AppleScript</span>
    <span style="color: #5C6370;">;;; </span><span style="color: #5C6370;">Cite: http://sakito.jp/emacs/emacsobjectivec.html</span>
(<span style="color: #c678dd;">defun</span> <span style="color: #61afef;">do-test-applescript</span> ()
  (<span style="color: #c678dd;">interactive</span>)
  (do-applescript
   (format
    (concat
     <span style="color: #98c379;">"display dialog \"Hello world!\" \r"</span>))))

  <span style="color: #5C6370;">;;;</span><span style="color: #5C6370;">###autoload</span>
(<span style="color: #c678dd;">defun</span> <span style="color: #61afef;">describe-timer</span> ()
  <span style="color: #98c379;">"see http://masutaka.net/chalow/2009-12-05-1.html"</span>
  (<span style="color: #c678dd;">interactive</span>)
  (<span style="color: #c678dd;">let</span> ((tl timer-list) time
        (timer nil))
    (pop-to-buffer (get-buffer-create <span style="color: #98c379;">"*timer*"</span>))
    (erase-buffer)
    (insert
     <span style="color: #98c379;">"TIME           FUNCTION\n"</span>
     <span style="color: #98c379;">"-------------- ----------------------\n"</span>)
    (<span style="color: #c678dd;">while</span> tl
      (<span style="color: #c678dd;">setq</span> timer (car tl))
      (insert
       (concat
        (format-time-string <span style="color: #98c379;">"%m/%d %T"</span>
                            (list (aref timer 1)
                                  (aref timer 2)
                                  (aref timer 3)))
        <span style="color: #98c379;">" "</span>
        (symbol-name (aref timer 5))
        <span style="color: #98c379;">"\n"</span>))
      (<span style="color: #c678dd;">setq</span> tl (cdr tl)))
    (read-only-mode 1)))
</code></pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgcbd85f7" class="outline-2">
<h2 id="orgcbd85f7"><span class="section-number-2">3</span> 未設定／テスト中</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org28586f4" class="outline-3">
<h3 id="org28586f4"><span class="section-number-3">3.1</span> byte-compile の警告を抑制する</h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">
<pre><code class="src src-emacs-lisp"><span style="color: #5C6370;">;; </span><span style="color: #5C6370;">Avoid warning (for sense-region)</span>
<span style="color: #5C6370;">;; </span><span style="color: #5C6370;">Warning: 'mapcar' called for effect; use 'mapc' or 'dolist' insted</span>
(<span style="color: #c678dd;">setq</span> byte-compile-warnings
      '(free-vars unresolved callargs redefine obsolete noruntime
      cl-functions interactive-only make-local))
</code></pre>
</div>
</div>
</div>

<div id="outline-container-org1469588" class="outline-3">
<h3 id="org1469588"><span class="section-number-3">3.2</span> [window-resizer.el] 分割したウィンドウサイズを変更する</h3>
<div class="outline-text-3" id="text-3-2">
<p>
<a href="http://d.hatena.ne.jp/khiker/20100119/window_resize">http://d.hatena.ne.jp/khiker/20100119/window_resize</a><br />
</p>

<p>
以下の警告を参考に書き換えた．<br />
</p>

<div class="org-src-container">
<pre><code class="src src-emacs-lisp">In my:window-resizer:
utility.el:333:23:Warning: `<span style="color: #d19a66;">last-command-char</span>' is an obsolete variable (as of
    Emacs at least 19.34)<span style="color: #5C6370;">; </span><span style="color: #5C6370;">use `</span><span style="color: #d19a66;">last-command-event</span><span style="color: #5C6370;">' instead.</span>
</code></pre>
</div>

<div class="org-src-container">
<pre><code class="src src-emacs-lisp"><span style="color: #5C6370;">;;;</span><span style="color: #5C6370;">###</span><span style="color: #ff982d; font-weight: bold;">autoload</span>
(<span style="color: #c678dd;">defun</span> <span style="color: #61afef;">takaxp:window-resizer</span> ()
  <span style="color: #98c379;">"Control separated window size and position.</span>
<span style="color: #98c379;">   Type {j,k,l,m} to adjust windows size."</span>
  (<span style="color: #c678dd;">interactive</span>)
  (<span style="color: #c678dd;">let</span> ((window-obj (selected-window))
        (current-width (window-width))
        (current-height (window-height))
        (dx (<span style="color: #c678dd;">if</span> (= (nth 0 (window-edges)) 0) 1
              -1))
        (dy (<span style="color: #c678dd;">if</span> (= (nth 1 (window-edges)) 0) 1
              -1))
        action c)
    (<span style="color: #c678dd;">catch</span> '<span style="color: #d19a66;">end-flag</span>
      (<span style="color: #c678dd;">while</span> t
        (<span style="color: #c678dd;">setq</span> action
              (read-key-sequence-vector (format <span style="color: #98c379;">"size[%dx%d]"</span>
                                                (window-width)
                                                (window-height))))
        (<span style="color: #c678dd;">setq</span> c (aref action 0))
        (<span style="color: #c678dd;">cond</span> ((= c ?l)
               (enlarge-window-horizontally dx))
              ((= c ?h)
               (shrink-window-horizontally dx))
              ((= c ?j)
               (enlarge-window dy))
              ((= c ?k)
               (shrink-window dy))
              <span style="color: #5C6370;">;; </span><span style="color: #5C6370;">otherwise</span>
              (t
               (<span style="color: #c678dd;">let</span> ((last-command-event (aref action 0))
                     (command (key-binding action)))
                 (<span style="color: #c678dd;">when</span> command
                   (call-interactively command)))
               (message <span style="color: #98c379;">"Quit"</span>)
               (<span style="color: #c678dd;">throw</span> '<span style="color: #d19a66;">end-flag</span> t)))))))
</code></pre>
</div>
</div>
</div>

<div id="outline-container-orgced035d" class="outline-3">
<h3 id="orgced035d"><span class="section-number-3">3.3</span> [idle-requie]</h3>
<div class="outline-text-3" id="text-3-3">
<div class="org-src-container">
<pre><code class="src src-emacs-lisp">(<span style="color: #c678dd;">require</span> '<span style="color: #d19a66;">idle-require</span>)
(idle-require-mode 1)
</code></pre>
</div>
</div>
</div>

<div id="outline-container-orgab08323" class="outline-3">
<h3 id="orgab08323"><span class="section-number-3">3.4</span> [pdf-preview]</h3>
<div class="outline-text-3" id="text-3-4">
<div class="org-src-container">
<pre><code class="src src-emacs-lisp">(<span style="color: #c678dd;">require</span> '<span style="color: #d19a66;">pdf-preview</span>)
</code></pre>
</div>
</div>
</div>

<div id="outline-container-orgfb9016d" class="outline-3">
<h3 id="orgfb9016d"><span class="section-number-3">3.5</span> [EasyPG]</h3>
<div class="outline-text-3" id="text-3-5">
<div class="org-src-container">
<pre><code class="src src-emacs-lisp">(<span style="color: #c678dd;">when</span> (<span style="color: #c678dd;">require</span> '<span style="color: #d19a66;">epa-setup</span> nil t)
  (epa-file-enable))
</code></pre>
</div>
</div>
</div>
