utility.org
** [eblook]
#+BEGIN_SRC emacs-lisp :tangle no
  ;; eblook
  (when (require 'eblook nil t)
    (autoload 'edict-search-english "edic"
      "Search for a translation of an English word" t)
    (autoload 'edict-search-kanji "edict"
      "Search for a translation of a Kanji sequence" t)
    (setq *edict-files* '("/Users/taka/Dropbox/Dic/LDOCE4"))
    (setq *edict-files* '("/Users/taka/Downloads/edict/edict")))
#+END_SRC

** [iBuffer]
iBuffer で list-buffers をオーバーライド（C-x C-b で表示）

#+BEGIN_SRC emacs-lisp :tangle no
(defalias 'list-buffers 'ibuffer)
#+END_SRC

** UUID をファイル名にして所定のディレクトリにコピー／移動
  - すでに org-attach が存在するので用途が微妙に．．．

#+BEGIN_SRC emacs-lisp :tangle no
(defvar org-att-global-directory "~/Dropbox/org/attachment/")
(defun copy-file-with-uuid (input)
  (interactive "FFile name: ")
  (if (file-exists-p input)
      (let* ((id (org-id-uuid))
             (filename (expand-file-name input))
             (directory (file-name-directory filename))
             (extension (file-name-extension filename))
             (output (concat org-att-global-directory id "." extension)))
        (copy-file filename output)
        (message "--- Copied as %s " output)
        output)
    (message "--- %s does NOT exist." input)
    nil))

(defun rename-file-with-uuid (input)
  (interactive "FFile name: ")
  (if (file-exists-p input)
      (let* ((id (org-id-uuid))
             (filename (expand-file-name input))
             (directory (file-name-directory filename))
             (extension (file-name-extension filename))
             (output (concat directory id "." extension)))
        (rename-file filename output)
        (message "--- Renamed as %s " output)
        output)
    (message "--- %s does NOT exist." input)
    nil))

(defun org-link-uuid (input &optional overwrite)
  (interactive "FFile name: ")
  (let ((output
         (if overwrite
             (rename-file-with-uuid input)
           (copy-file-with-uuid input))))
    (when output
      (insert (concat "[[file+sys:" output
                      "][" (file-name-base input) "]]\n")))))
#+END_SRC

** キーバインド
#+BEGIN_SRC emacs-lisp :tangle no
;; Multiple combination
; Editing with a rectangle region
(global-set-key (kbd "C-x r C-SPC") 'rm-set-mark)
(global-set-key (kbd "C-x r C-x") 'rm-exchange-point-and-mark)
(global-set-key (kbd "C-x r C-w") 'rm-kill-region)
(global-set-key (kbd "C-x r M-w") 'rm-kill-ring-save)
#+END_SRC

* provide

以上です．

#+BEGIN_SRC emacs-lisp :tangle yes :exports none
  (provide 'utility)
#+END_SRC
