utility.html

<div id="outline-container-orgcced323" class="outline-3">
<h3 id="orgcced323"><span class="section-number-3">3.6</span> [eblook]</h3>
<div class="outline-text-3" id="text-3-6">
<div class="org-src-container">
<pre><code class="src src-emacs-lisp"><span style="color: #5C6370;">;; </span><span style="color: #5C6370;">eblook</span>
(<span style="color: #c678dd;">when</span> (<span style="color: #c678dd;">require</span> '<span style="color: #d19a66;">eblook</span> nil t)
  (autoload 'edict-search-english <span style="color: #98c379;">"edic"</span>
    <span style="color: #98c379;">"Search for a translation of an English word"</span> t)
  (autoload 'edict-search-kanji <span style="color: #98c379;">"edict"</span>
    <span style="color: #98c379;">"Search for a translation of a Kanji sequence"</span> t)
  (<span style="color: #c678dd;">setq</span> *edict-files* '(<span style="color: #98c379;">"/Users/taka/Dropbox/Dic/LDOCE4"</span>))
  (<span style="color: #c678dd;">setq</span> *edict-files* '(<span style="color: #98c379;">"/Users/taka/Downloads/edict/edict"</span>)))
</code></pre>
</div>
</div>
</div>

<div id="outline-container-org23d1c54" class="outline-3">
<h3 id="org23d1c54"><span class="section-number-3">3.7</span> [iBuffer]</h3>
<div class="outline-text-3" id="text-3-7">
<p>
iBuffer で list-buffers をオーバーライド（C-x C-b で表示）<br />
</p>

<div class="org-src-container">
<pre><code class="src src-emacs-lisp">(<span style="color: #c678dd;">defalias</span> '<span style="color: #61afef;">list-buffers</span> 'ibuffer)
</code></pre>
</div>
</div>
</div>

<div id="outline-container-org7098456" class="outline-3">
<h3 id="org7098456"><span class="section-number-3">3.8</span> UUID をファイル名にして所定のディレクトリにコピー／移動</h3>
<div class="outline-text-3" id="text-3-8">
<ul class="org-ul">
<li>すでに org-attach が存在するので用途が微妙に．．．<br /></li>
</ul>

<div class="org-src-container">
<pre><code class="src src-emacs-lisp">(<span style="color: #c678dd;">defvar</span> <span style="color: #e5c07b;">org-att-global-directory</span> <span style="color: #98c379;">"~/Dropbox/org/attachment/"</span>)
(<span style="color: #c678dd;">defun</span> <span style="color: #61afef;">copy-file-with-uuid</span> (input)
  (<span style="color: #c678dd;">interactive</span> <span style="color: #98c379;">"FFile name: "</span>)
  (<span style="color: #c678dd;">if</span> (file-exists-p input)
      (<span style="color: #c678dd;">let*</span> ((id (org-id-uuid))
             (filename (expand-file-name input))
             (directory (file-name-directory filename))
             (extension (file-name-extension filename))
             (output (concat org-att-global-directory id <span style="color: #98c379;">"."</span> extension)))
        (copy-file filename output)
        (message <span style="color: #98c379;">"--- Copied as %s "</span> output)
        output)
    (message <span style="color: #98c379;">"--- %s does NOT exist."</span> input)
    nil))

(<span style="color: #c678dd;">defun</span> <span style="color: #61afef;">rename-file-with-uuid</span> (input)
  (<span style="color: #c678dd;">interactive</span> <span style="color: #98c379;">"FFile name: "</span>)
  (<span style="color: #c678dd;">if</span> (file-exists-p input)
      (<span style="color: #c678dd;">let*</span> ((id (org-id-uuid))
             (filename (expand-file-name input))
             (directory (file-name-directory filename))
             (extension (file-name-extension filename))
             (output (concat directory id <span style="color: #98c379;">"."</span> extension)))
        (rename-file filename output)
        (message <span style="color: #98c379;">"--- Renamed as %s "</span> output)
        output)
    (message <span style="color: #98c379;">"--- %s does NOT exist."</span> input)
    nil))

(<span style="color: #c678dd;">defun</span> <span style="color: #61afef;">org-link-uuid</span> (input <span style="color: #CFCB90;">&amp;optional</span> overwrite)
  (<span style="color: #c678dd;">interactive</span> <span style="color: #98c379;">"FFile name: "</span>)
  (<span style="color: #c678dd;">let</span> ((output 
         (<span style="color: #c678dd;">if</span> overwrite 
             (rename-file-with-uuid input)
           (copy-file-with-uuid input))))
    (<span style="color: #c678dd;">when</span> output
      (insert (concat <span style="color: #98c379;">"[[file+sys:"</span> output
                      <span style="color: #98c379;">"]["</span> (file-name-base input) <span style="color: #98c379;">"]]\n"</span>)))))
</code></pre>
</div>
</div>
</div>

<div id="outline-container-orgc9cb4d1" class="outline-3">
<h3 id="orgc9cb4d1"><span class="section-number-3">3.9</span> キーバインド</h3>
<div class="outline-text-3" id="text-3-9">
<div class="org-src-container">
<pre><code class="src src-emacs-lisp"><span style="color: #5C6370;">;; </span><span style="color: #5C6370;">Multiple combination</span>
<span style="color: #5C6370;">; </span><span style="color: #5C6370;">Editing with a rectangle region</span>
(global-set-key (kbd <span style="color: #98c379;">"C-x r C-SPC"</span>) 'rm-set-mark)
(global-set-key (kbd <span style="color: #98c379;">"C-x r C-x"</span>) 'rm-exchange-point-and-mark)
(global-set-key (kbd <span style="color: #98c379;">"C-x r C-w"</span>) 'rm-kill-region)
(global-set-key (kbd <span style="color: #98c379;">"C-x r M-w"</span>) 'rm-kill-ring-save)
</code></pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org50ccbf7" class="outline-2">
<h2 id="org50ccbf7"><span class="section-number-2">4</span> provide</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">
<pre><code class="src src-emacs-lisp">(<span style="color: #c678dd;">provide</span> '<span style="color: #d19a66;">utility</span>)
</code></pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Takaaki Ishikawa</p>
<p class="date">Created: 2017-06-19 Mon 01:03</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
