utility.el

(provide 'utility)
